<div style ="background-color: #002147; padding: 20px; text-align: center; color:white; font-size:32px" font-family:'Arial'>Data Aquisition:Understanding Data sources, using SQL </div>

In [1]:
# Question: can we create a CSV file using python?
import csv  #used for creating csv files
header = ['Name', 'Age', 'City']
rows = [
    ['Amit', 32, 'Ambala'],
        ['Seema',39,'Ambala'],
        ['Deepti',36,'Delhi']
        ]

In [2]:
header

['Name', 'Age', 'City']

In [3]:
rows

[['Amit', 32, 'Ambala'], ['Seema', 39, 'Ambala'], ['Deepti', 36, 'Delhi']]

In [4]:
# create a CSV file
with open('friends.csv', mode='w', newline='') as file:
    writer = csv.writer(file)
    writer.writerow(header)
    writer.writerows(rows)
print("CSV Created")

CSV Created

In [5]:
header1=['Name','Roll_No','Class','school','age','city','maths','hindi','science','SocialScience''English']
Rows=[['Seema',1,'9th','PKR Jain Pub School',14, 'Ambala',65,70,80,90,95],
      ['Reema',2,'9th','PKR Jain Pub School',14, 'Ambala',68,72,85,90,95],
      ['Seema Singh',3,'9th','PKR Jain Pub School',15, 'Ambala',69,77,80,98,95],
      ['Reena',4,'9th','PKR Jain Pub School',14, 'Ambala',65,70,80,90,95]]
with open('students.csv', mode='w', newline='') as file:
    writer = csv.writer(file)
    writer.writerow(header1)
    writer.writerows(Rows)
print("CSV Created")

CSV Created

In [6]:
import json
data = [
    {'Name': 'Amit', 'Age': 32, 'City': 'Ambala'},
    {'Name': 'Seema', 'Age': 39, 'City': 'Ambala'},
    {'Name': 'Deepti', 'Age': 36, 'City': 'Delhi'}
]
with open('student.json', 'w') as json_file:
    json.dump(data, json_file, indent=4)
print("JSON Created")

JSON Created

In [7]:
Students=['Seema','Reema','Seema Singh','Reena']
for student in Students:
    print(student)

Seema
Reema
Seema Singh
Reena

In [8]:
import sqlite3 as sql
connection=sql.connect('demo.db')
cursor=connection.cursor()
cursor.execute('''create table students( id integer Primary Key,
                      name text not null,
                      age integer,
                      city text);''')

print("Table created successfully")
connection.commit()

OperationalError: table students already exists

In [ ]:
cursor.execute('''insert into students (name,age,city) values
                  ('Seema',14,'Ambala'),
                  ('Reema',15,'Delhi'),
                  ('Deepti',16,'Chandigarh');''')

In [ ]:
cursor.execute('''insert into students (name,age,city) values
                  ('Seema',14,'Ambala');''')

In [ ]:
cursor.execute("select * from students;")

In [ ]:
results=cursor.fetchall()
for row in results:
    print(row)

(1, 'Seema', 14, 'Ambala')
(2, 'Reema', 15, 'Delhi')
(3, 'Deepti', 16, 'Chandigarh')
(4, 'Seema', 14, 'Ambala')
(5, 'Reema', 15, 'Delhi')
(6, 'Deepti', 16, 'Chandigarh')
(7, 'Seema', 14, 'Ambala')
(8, 'Reema', 15, 'Delhi')
(9, 'Deepti', 16, 'Chandigarh')
(10, 'Seema', 14, 'Ambala')

In [ ]:
import pandas as pd
df=pd.DataFrame(results)
df

    0       1   2           3
0   1   Seema  14      Ambala
1   2   Reema  15       Delhi
2   3  Deepti  16  Chandigarh
3   4   Seema  14      Ambala
4   5   Reema  15       Delhi
5   6  Deepti  16  Chandigarh
6   7   Seema  14      Ambala
7   8   Reema  15       Delhi
8   9  Deepti  16  Chandigarh
9  10   Seema  14      Ambala

In [ ]:
df

   0       1   2           3
0  1   Seema  14      Ambala
1  2   Reema  15       Delhi
2  3  Deepti  16  Chandigarh
3  4   Seema  14      Ambala
4  5   Reema  15       Delhi
5  6  Deepti  16  Chandigarh
6  7   Seema  14      Ambala
7  8   Reema  15       Delhi
8  9  Deepti  16  Chandigarh